export const skipClassReasons = [
  {
    label: "就職活動",
    value: "本日なのですが、就職活動のため、講義を受けれそうにありません。",
  },
  {
    label: "体調不良",
    value:
      "本日なのですが、体調を崩してしまい、講義を受けられそうにありません。",
  },
  {
    label: "身内の不幸",
    value:
      "先日、身内に不幸があったため、急遽欠席させていただきたく、失礼とは存じますがここに取り急ぎメールにてご連絡させていただきます。",
  },
  {
    label: "冠婚葬祭",
    value: "本日なのですが、冠婚葬祭のため、講義を受けれそうにありません。",
  },
  {
    label: "交通機関の遅延",
    value:
      "ただいま大学に向かっているのですが、人身事故の影響で電車が止まってしまい、講義時間内の到着が難しいとのことです。",
  },
];

export const cancelOfferReasons = [
  {
    label: "内定辞退",
    value:
      "この度は、内定のご連絡をいただき、誠にありがとうございます。内定通知をいただき大変恐縮ですが、今回の内定を辞退させていただきたく、ご連絡いたしました。 自分のキャリアについて検討した結果、他社とのご縁を感じ、御社の内定を辞退する決断にいたりました。",
  },
  {
    label: "長期インターン内定辞退",
    value:
      "先日は長期インターンの採用連絡をいただきありがとうございました。 大変申し訳ございませんが、この度、他企業様での長期インターン採用が決まったため、長期インターンの内定辞退をさせていただきたくご連絡をいたしました。 お忙しい中、面接の機会をいただいたのにも関わらず、誠に申し訳ございません。",
  },
  {
    label: "サマーインターン内定辞退",
    value:
      "先日はサマーインターンの採用連絡をいただきありがとうございました。 大変申し訳ございませんが、この度、同時期に他企業様でのサマーインターン採用が決まったため、サマーインターンの内定辞退をさせていただきたくご連絡をいたしました。 お忙しい中、面接の機会をいただいたのにも関わらず、誠に申し訳ございません。",
  },
];

export const skipPartTimeReasons = [
  {
    label: "シフト勘違い",
    value:
      "本日なのですが、シフトを勘違いをしてしまい日時を誤解してしまっていたため、出勤できそうにありません。 連絡が遅れてしまったこと、予定されていたシフトに出席できなかったことに深く反省しております。これから、このような状況が発生しないよう気をつけます。",
  },
  {
    label: "体調不良",
    value:
      "大変申し訳ないのですが、昨日から体調が優れず今日も回復しないので、お休みをいただけないでしょうか。当日の連絡となってしまい、大変申し訳ありません。",
  },
  {
    label: "身内の不幸",
    value:
      "先日身内に不幸があったため、本日のバイトをお休みさせていただきたいです。当日の連絡となってしまい、大変申し訳ありません。",
  },
  {
    label: "ペットの具合が悪い",
    value:
      "本日なのですが、私の飼っている{該当のペットの名前に書き換えてください}の具合がかなり悪く病院に連れて行きたいのですが、連れて行けるのが自分しかいないので、本日バイトをお休みさせていただけないでしょうか。当日の連絡となってしまい、大変申し訳ありません。",
  },
];
